balazsgrill/modembed/res/Devices/18xxxx/PIC18LF46K22.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP4CON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP4CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP4M" edc:desc="" edc:mask="0xf" edc:name="CCP4M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC4B" edc:desc="" edc:mask="0x3" edc:name="DC4B" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP4M0" edc:desc="" edc:mask="0x1" edc:name="CCP4M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M1" edc:desc="" edc:mask="0x1" edc:name="CCP4M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M2" edc:desc="" edc:mask="0x1" edc:name="CCP4M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M3" edc:desc="" edc:mask="0x1" edc:name="CCP4M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B0" edc:desc="" edc:mask="0x1" edc:name="DC4B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B1" edc:desc="" edc:mask="0x1" edc:name="DC4B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR4" edc:desc="" edc:name="CCPR4" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4L" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR4L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4L" edc:desc="" edc:mask="0xff" edc:name="CCPR4L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4H" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR4H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4H" edc:desc="" edc:mask="0xff" edc:name="CCPR4H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR3CON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR3CON" edc:nzwidth="0x8" edc:por="---00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR3A" edc:desc="" edc:mask="0x1" edc:name="STR3A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR3B" edc:desc="" edc:mask="0x1" edc:name="STR3B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR3C" edc:desc="" edc:mask="0x1" edc:name="STR3C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR3D" edc:desc="" edc:mask="0x1" edc:name="STR3D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR3SYNC" edc:desc="" edc:mask="0x1" edc:name="STR3SYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3AS" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3AS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCP3AS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P3SSBD" edc:desc="" edc:mask="0x3" edc:name="P3SSBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P3SSAC" edc:desc="" edc:mask="0x3" edc:name="P3SSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP3AS" edc:desc="" edc:mask="0x7" edc:name="CCP3AS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CCP3ASE" edc:desc="" edc:mask="0x1" edc:name="CCP3ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P3SSBD0" edc:desc="" edc:mask="0x1" edc:name="P3SSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3SSBD1" edc:desc="" edc:mask="0x1" edc:name="P3SSBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3SSAC0" edc:desc="" edc:mask="0x1" edc:name="P3SSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3SSAC1" edc:desc="" edc:mask="0x1" edc:name="P3SSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3AS0" edc:desc="" edc:mask="0x1" edc:name="CCP3AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3AS1" edc:desc="" edc:mask="0x1" edc:name="CCP3AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3AS2" edc:desc="" edc:mask="0x1" edc:name="CCP3AS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PSS3BD" edc:desc="" edc:mask="0x3" edc:name="PSS3BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS3AC" edc:desc="" edc:mask="0x3" edc:name="PSS3AC" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PSS3BD0" edc:desc="" edc:mask="0x1" edc:name="PSS3BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3BD1" edc:desc="" edc:mask="0x1" edc:name="PSS3BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC0" edc:desc="" edc:mask="0x1" edc:name="PSS3AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC1" edc:desc="" edc:mask="0x1" edc:name="PSS3AC1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3CON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P3DC" edc:desc="" edc:mask="0x7f" edc:name="P3DC" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="P3RSEN" edc:desc="" edc:mask="0x1" edc:name="P3RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P3DC0" edc:desc="" edc:mask="0x1" edc:name="P3DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC1" edc:desc="" edc:mask="0x1" edc:name="P3DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC2" edc:desc="" edc:mask="0x1" edc:name="P3DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:alias="T1G_DONE" edc:cname="P3DC3" edc:desc="" edc:mask="0x1" edc:name="P3DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC4" edc:desc="" edc:mask="0x1" edc:name="P3DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC5" edc:desc="" edc:mask="0x1" edc:name="P3DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC6" edc:desc="" edc:mask="0x1" edc:name="P3DC6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP3CON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP3CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3M" edc:desc="" edc:mask="0xf" edc:name="CCP3M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC3B" edc:desc="" edc:mask="0x3" edc:name="DC3B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P3M" edc:desc="" edc:mask="0x3" edc:name="P3M" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3M0" edc:desc="" edc:mask="0x1" edc:name="CCP3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M1" edc:desc="" edc:mask="0x1" edc:name="CCP3M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M2" edc:desc="" edc:mask="0x1" edc:name="CCP3M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:alias="T1G_DONE" edc:cname="CCP3M3" edc:desc="" edc:mask="0x1" edc:name="CCP3M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B0" edc:desc="" edc:mask="0x1" edc:name="DC3B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B1" edc:desc="" edc:mask="0x1" edc:name="DC3B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3M0" edc:desc="" edc:mask="0x1" edc:name="P3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3M1" edc:desc="" edc:mask="0x1" edc:name="P3M1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR3" edc:desc="" edc:name="CCPR3" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3L" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR3L" edc:desc="" edc:mask="0xff" edc:name="CCPR3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
